In [17]:
# coding:utf-8
import pandas as pd

In [18]:
titanic = pd.read_csv(filepath_or_buffer="data/titanic.csv")  # 加载文件

In [19]:
titanic.head(3)  # 显示前三行

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [20]:
# 加载 age 列数据
ages = titanic["Age"]
ages.head(3)

0    22.0
1    38.0
2    26.0
Name: Age, dtype: float64

In [21]:
type(titanic["Age"])  # 每一个列都是一个系列

pandas.core.series.Series

In [22]:
# DataFrame.shape是熊猫的属性,熊猫系列是一维的，只返回行数
titanic["Age"].shape

(891,)

In [23]:
# 我对泰坦尼克号乘客的年龄和性别很感兴趣
age_sex = titanic[["Age", "Sex"]]

In [24]:
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [25]:
# 返回的数据类型是熊猫数据帧
type(titanic[["Age", "Sex"]])

pandas.core.frame.DataFrame

In [26]:
titanic[["Age", "Sex"]].shape

(891, 2)

In [27]:
# 筛选特定行
# 我对35岁以上的乘客很感兴趣
above_35 = titanic[titanic["Age"] > 35]
above_35.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [30]:
# 要根据有条件的表达选择行，请使用选择括号内的条件
titanic.head(3)["Age"] > 35

0    False
1     True
2    False
Name: Age, dtype: bool

In [35]:
# 显示数组的行，列数
above_35.shape

(217, 12)

In [36]:
# 我对2号和3号舱的泰坦尼克号乘客很感兴趣。
class_23 = titanic[titanic["Pclass"].isin([2, 3])]
"""
与条件表达类似，isin（）条件函数返回所提供列表中值的每个行的一个。
要根据此函数筛选行，请使用选择括号内的条件函数。在这种情况下，
选择括号内的状态检查列行为 2 或 3 的行。
"""

In [37]:
class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [38]:
class_23.shape

(675, 12)

In [39]:
# 以上等于按类为 2 或 3 的行进行筛选，并将两个语句与 （或） 操作员合并：|
class_23 = titanic[(titanic["Pclass"] == 2) |
                   (titanic["Pclass"] == 3)]

In [40]:
# 当组合多个条件语句时，每个条件都必须由括号包围。此外，你不能使用/但需要使用运营商和操作员。()or and or|and&
class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [52]:
# 我想处理已知年龄的乘客数据。
age_no_na = titanic[titanic["Age"].notna()]

In [53]:
# notna（）有条件函数为每行返回一个不为null的值。因此，这可以与选择括号相结合以过滤数据表。
age_no_na.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
age_no_na.shape

(714, 12)

In [ ]:
#### notna（）有条件函数为每行返回一个值不是值。因此，这可以与选择括号相结合以过滤数据表。

In [59]:
# 我对35岁以上的乘客的名字很感兴趣
adult_names = titanic.loc[titanic["Age"]>35, ("Name", "Age")]

In [60]:
# 行和列的子集是一次性制作的，仅使用选择括号已经不够了。/操作员必须在选择括号前。使用 /时，逗号前的部分是您想要的行，逗号后的部分是您要选择的列
adult_names.head()

                                                 Name   Age
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
6                             McCarthy, Mr. Timothy J  54.0
11                           Bonnell, Miss. Elizabeth  58.0
13                        Andersson, Mr. Anders Johan  39.0
15                    Hewlett, Mrs. (Mary D Kingcome)  55.0

In [61]:
# 行和列的子集是一次性制作的，仅使用选择括号已经不够了。/操作员必须在选择括号前。使用 /时，逗号前的部分是您想要的行，逗号后的部分是您要选择的列
titanic.iloc[9:25, 2:5]

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                    Hewlett, Mrs. (Mary D Kingcome)  female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

In [62]:
# 在选择带有或具有或具有新值的特定行和/或列时，可以将新值分配给选定的数据。例如，将名称分配给第三列的前 3 个元素
titanic.iloc[0:3, 3] = "anonymous"
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,anonymous,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,anonymous,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,anonymous,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S